RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA156/MCXA156/drivers/fsl_lpspi.c
        /*Wait until TX FIFO is not full*/
#if SPI_RETRY_TIMES
        uint32_t waitTimes = SPI_RETRY_TIMES;
        while ((LPSPI_GetTxFifoCount(base) == fifo_size) && ((--waitTimes) != 0U))
#else
        while (LPSPI_GetTxFifoCount(base) == fifo_size)
#endif
        {
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return false;
        }
#endif

        /* To prevent rxfifo overflow, ensure transmitting and receiving are executed in parallel */
        if (((NULL == (stateParams->rxData)) ||
             ((stateParams->rxRemainingByteCount) - txRemainingByteCount) < rxFifoMaxBytes))
        {
            if (stateParams->isTxMask)
            {
                /* When TCR[TXMSK]=1, transfer is initiate by writting a new command word to TCR. TCR[TXMSK] is cleared
                   by hardware every time when TCR[FRAMESZ] bit of data is transfered.
                   In this case TCR[TXMSK] should be set to initiate each transfer. */
                base->TCR |= LPSPI_TCR_TXMSK_MASK;
                if (stateParams->isPcsContinuous && (txRemainingByteCount == bytesPerFrame))
                {
                    /* For the last piece of frame size of data, if is PCS continous mode(TCR[CONT]), TCR[CONTC] should
                     * be cleared to de-assert the PCS. Be sure to clear the TXMSK as well otherwise another FRAMESZ
                     * of data will be received. */
                    base->TCR &= ~(LPSPI_TCR_CONTC_MASK | LPSPI_TCR_CONT_MASK | LPSPI_TCR_TXMSK_MASK);
                }
                else
                {
                    if (!LPSPI_WaitTxFifoEmpty(base))
                    {
                        return false;
                    }
                }
                txRemainingByteCount -= bytesPerFrame;
            }
            else
            {
                if ((stateParams->txData) != NULL)
                {
                    if (stateParams->bytesEachWrite != 1U)
                    {
                        wordToSend =
                            LPSPI_CombineWriteData((stateParams->txData), (stateParams->bytesEachWrite), isByteSwap);
                        (stateParams->txData) += (stateParams->bytesEachWrite);
                    }
                    else
                    {
                        wordToSend = *(stateParams->txData);
                        (stateParams->txData) += 1U;
                    }
                }
                /* Otherwise push data to tx FIFO to initiate transfer */
                LPSPI_WriteData(base, wordToSend);
                txRemainingByteCount -= (stateParams->bytesEachWrite);
            }
        }

        /* Check whether there is RX data in RX FIFO . Read out the RX data so that the RX FIFO would not overrun. */
        /*
         * $Branch Coverage Justification$
         * Data will be transferred in the inner loop until complete, after which the interrupt will end.(will improve)
         */
        if (((stateParams->rxData) != NULL) && ((stateParams->rxRemainingByteCount) != 0U))
        {
            /* To ensure parallel execution in 3-wire mode, after writting 1 to TXMSK to generate clock of
               bytesPerFrame's data wait until bytesPerFrame's data is received. */
            while ((stateParams->isTxMask) && (LPSPI_GetRxFifoCount(base) == 0U))
            {
            }
#if SPI_RETRY_TIMES
            uint32_t waitTimes = SPI_RETRY_TIMES;
            while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
            while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
            {
                readData = LPSPI_ReadData(base);
                /*
                 * $Branch Coverage Justification$
                 * rxRemainingByteCount must be an integer multiple of bytesEachRead, otherwise it cannot pass the check
                 * of #LPSPI_CheckTransferArgument,so it doesn't happen here.(will improve)
                 */
                if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead))
                {
                    (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount);
                }

                LPSPI_SeparateReadData((stateParams->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
                (stateParams->rxData) += (stateParams->bytesEachRead);

                (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
            }
#if SPI_RETRY_TIMES
            if (waitTimes == 0U)
            {
                return false;
            }
#endif
        }
    }
    return true;
}

static bool LPSPI_MasterTransferClearTCR(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams)
{
#if SPI_RETRY_TIMES
    uint32_t waitTimes = SPI_RETRY_TIMES;
    while ((LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base)) && (--waitTimes != 0U))
#else
    while (LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base))
#endif
    {
    }
#if SPI_RETRY_TIMES
    if (waitTimes == 0U)
    {
        return false;
    }
#endif
    base->TCR = (base->TCR & ~(LPSPI_TCR_CONTC_MASK | LPSPI_TCR_CONT_MASK));

    return true;
}

static bool LPSPI_MasterTransferReadDataInFifo(LPSPI_Type *base,
                                               lpspi_transfer_t *transfer,
                                               lpspi_transfer_blocking_param_t *stateParams)
{
    uint32_t readData;
    bool isByteSwap = ((transfer->configFlags & (uint32_t)kLPSPI_MasterByteSwap) != 0U);
    while ((stateParams->rxRemainingByteCount) > 0U)
    {
#if SPI_RETRY_TIMES
        uint32_t waitTimes = SPI_RETRY_TIMES;
        while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
        while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
        {
            readData = LPSPI_ReadData(base);

            if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead))
            {
                (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount);
            }

            LPSPI_SeparateReadData((stateParams->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
            (stateParams->rxData) += (stateParams->bytesEachRead);

            (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return false;
        }
#endif
    }

